// Модуль 3
// Задание 1 Подсчитать сумму всех чисел в заданном пользователем
//диапазоне.

// let num1=+prompt("Enter number one");
// let num2=+prompt("enter number two");

// function summ(a,b)
// {
//     let x=0;
//     for(;a<=b;a++)
//     {
//         x+=a;
//     }
//     return x;
// }
// console.log(summ(num1,num2));


////////////////////////////////////////////////////////////////////////////////////


//Задание 4 Определить количество цифр в введенном числе.

// let digit=prompt("");
// let x=0;
// for(let i=1;i<=digit.length;i++)
// {
//     x++;
// }
// console.log(x);


/////////////////////////////////////////////////////////////////////////////////////


// 3. Запросить у пользователя число и вывести все делители этого числа.

// let num=+prompt("enter number");
// function summ(a)
// {
//     let arr=[];
//     for(let i=1;i<=a;i++)
//     {
//         if(a % i == 0)
//         {
//          arr+=[i];
//          arr+=[','];
//         }
//     }
//     return arr;
// }
// console.log(`Все делители ${summ(num)}`);


//////////////////////////////////////////////////////////////////////////////////


// 6. Зациклить калькулятор. Запросить у пользователя 2 числа
// и знак, решить пример, вывести результат и спросить, хочет ли он решить еще один пример. И так до тех пор, пока
// пользователь не откажется.

// let x=null;
// while(x!='-')
// {
//     let num1=+prompt("First Number");
//     let num2=+prompt("Second Number");
//     let inner=+prompt("Выберите:  вычитание(1) сложение(2) деление(3) умножение(4)");

//     switch(inner)
//     {
//           case 1 :
//             console.log(`${num1-num2}`);
//             break;

//             case 2 :
//                 console.log(`${num1+num2}`);
//                 break;

//                 case 3 :
//                     console.log(`${num1/num2}`);
//                     break;

//                     case 4 :
//                         console.log(`${num1*num2}`);
//                         break;
//                         default:
//                             console.log('ERROR');
//     }
//     x =prompt('Если хотите выйти нажмите (-) продолжить любую клавишу');
// }

///////////////////////////////////////////////////////////////////////////////////

// Модуль 4 

// Задание номер 1 Написать функцию, которая принимает 2 числа и возвращает -1, если первое меньше, чем второе; 1 – если первое 
// больше, чем второе; и 0 – если числа равны

// let qwerty=+prompt();
// let qwerty2=+prompt();

// function summ(a,b)
// {
//     if(a<b)
//     return -1;
//     if (a>b)
//     return 1;
//     if (a==b)
//     return 0;
//     else return "ERROR";
// }
// let x=summ(qwerty,qwerty2);
// console.log(x);

/////////////////////////////////////////////////////////////////////////////////////

// Задание 2 Написать функцию, которая вычисляет факториал переданного ей числа.

// let fact=+prompt();
// let digit=1;
// function factorial(x)
// {
//     if(x<0)
//     return 0;
//     if(x==0)
//     return 1;
//      else
//       return x * factorial(x-1);
// }
// console.log(factorial(fact));